{
  "IGF1-": "is a liver-derived growth hormone mediator promoting cell growth and metabolism.",
  "EPO--": "is produced by kidneys to boost red blood cell production when oxygen is low.",
  "IL4--": "is a Th2 cytokine driving IgE production and allergic responses.",
  "IL18-": "promotes Th1 responses and is elevated in autoimmune diseases.",
  "IL5--": "is an eosinophil differentiation factor promoting allergic inflammation and asthma.",
  "IGF2-": "is an embryonic growth factor crucial for fetal development.",
  "IL7--": "is essential for lymphocyte development and survival.",
  "IL3--": "supports hematopoietic stem cell differentiation into multiple cell lineages.",
  "IL15-": "activates NK cells and maintains CD8+ T-cell memory.",
  "IL9--": "is expressed by Th9 cells and enhances mast cell activation.",
  "IL13-": "promotes IgE synthesis, mucus production, and airway hyperresponsiveness.",
  "TNF--": "is a master inflammatory cytokine triggering immune responses and cell death.",
  "IL11-": "promotes platelet production and has anti-inflammatory properties.",
  "IL22-": "is an IL-10 family cytokine promoting epithelial tissue regeneration.",
  "TGFB1": "controls growth inhibition, immune regulation, and tissue fibrosis.",
  "TGFA-": "is an EGF family member promoting cell transformation and proliferation.",
  "IL2--": "is a T-cell growth factor essential for regulatory T-cell development.",
  "IL33-": "is an epithelial 'alarmin' driving Th2 responses in tissue damage.",
  "IL10-": "is an anti-inflammatory cytokine suppressing pro-inflammatory responses.",
  "IL6--": "triggers acute phase response and promotes B-cell differentiation.",
  "BMP2-": "is the gold standard osteogenic protein promoting bone formation.",
  "FGF23": "is bone-derived and regulates phosphate homeostasis and vitamin D.",
  "EGF--": "stimulates keratinocyte proliferation and wound repair.",
  "CXCL8": "is the most potent human neutrophil attractant promoting inflammation.",
  "LTA--": "is essential for immune organ development and tumor killing.",
  "IL20-": "drives vascular inflammation and promotes tissue repair.",
  "FGF2-": "stimulates angiogenesis, neural development, and cell survival.",
  "IL17A": "is a Th17 cytokine promoting neutrophil recruitment and autoimmune inflammation.",
  "PGF--": "drives pathological angiogenesis and placental development.",
  "BMP7-": "is critical for kidney development with anti-fibrotic properties.",
  "TGFB2": "is involved in embryonic development and tissue homeostasis.",
  "TGFB3": "promotes scarless wound healing and development.",
  "IL19-": "is an anti-inflammatory cytokine polarizing toward Th2 responses.",
  "MSTN-": "inhibits muscle growth; mutations cause double-muscle phenotype.",
  "AMH--": "masculinizes male embryos and indicates female fertility potential.",
  "IL24-": "is a tumor suppressor promoting cancer cell apoptosis.",
  "IL25-": "is an epithelial alarm signal driving allergic inflammation.",
  "IL1A-": "is a pro-inflammatory cytokine causing fever and acute phase responses.",
  "FGF21": "is liver-derived and regulates glucose and lipid metabolism during fasting.",
  "CSF2-": "stimulates white blood cell production from bone marrow.",
  "INHA-": "suppresses fertility hormone FSH from the pituitary.",
  "BMP4-": "is essential for mesoderm formation and embryonic patterning.",
  "IL26-": "is produced by Th17 cells and associated with autoimmune diseases.",
  "IL31-": "is the primary driver of itching in atopic dermatitis.",
  "IL27-": "has dual pro/anti-inflammatory functions regulating T-cell responses.",
  "FGF1-": "is a universal FGF promoting angiogenesis and tissue repair.",
  "HGF--": "promotes liver regeneration and angiogenesis.",
  "CCL5-": "attracts memory T cells, monocytes, and eosinophils in inflammation.",
  "LTB--": "partners with LTA for lymphoid organ development.",
  "FGF7-": "is essential for epithelial wound healing and tissue repair.",
  "GDF1-": "is critical for left-right body axis patterning.",
  "GDF5-": "is essential for joint development; mutations cause brachydactyly.",
  "GDF15": "is stress-induced and mediates cancer cachexia.",
  "FGF19": "regulates bile acid metabolism and glucose homeostasis.",
  "IL1B-": "is a major inflammatory mediator triggering fever and immune activation.",
  "CSF3-": "mobilizes stem cells and boosts neutrophil production during infections.",
  "INHBA": "has dual functions as both activin and inhibin in reproduction.",
  "INHBB": "is a reproductive hormone subunit affecting metabolism and fertility.",
  "XCL2-": "supports antigen cross-presentation by CD8+ dendritic cells.",
  "CCL24": "attracts eosinophils and basophils in allergic inflammation.",
  "XCL1-": "promotes antigen cross-presentation by specialized dendritic cells.",
  "CCL2-": "is the primary inflammatory monocyte chemoattractant.",
  "IL21-": "controls NK cell maturation and is produced by activated CD4+ T cells.",
  "CCL17": "attracts Th2 cells and is a biomarker for atopic dermatitis.",
  "CXCL1": "is a potent neutrophil chemoattractant mediating acute inflammation.",
  "IL12A": "is the p35 subunit essential for Th1 differentiation.",
  "FGF10": "is crucial for lung development and tissue morphogenesis.",
  "CSF1-": "promotes macrophage development and bone cell functions.",
  "BMP6-": "stimulates cartilage differentiation and regulates iron metabolism.",
  "GDF9-": "is oocyte-derived and essential for female fertility.",
  "CCL21": "guides dendritic cells and T cells to lymph nodes.",
  "CCL22": "attracts Th2 and regulatory T cells promoting immune suppression.",
  "CCL4-": "attracts monocytes, macrophages, and NK cells through multiple receptors.",
  "CCL7-": "promotes monocyte mobilization from bone marrow during inflammation.",
  "GDF11": "controls body patterning via HOX genes; potential anti-aging factor.",
  "GDF2-": "regulates angiogenesis and iron metabolism; mutations cause vascular disorders.",
  "CCL15": "has unclear function; possible role in leukocyte chemotaxis.",
  "IL36B": "promotes antimicrobial peptide expression in psoriasis.",
  "IL36A": "is an IL-1 family cytokine involved in psoriasis pathogenesis.",
  "IL36G": "is critical for intestinal wound repair and IBD.",
  "CCL1-": "binds CCR8 attracting Th2 and regulatory T cells.",
  "VEGFA": "is the master blood vessel growth factor and cancer drug target.",
  "CXCL9": "attracts Th1, NK, and CD8+ T cells for anti-tumor immunity.",
  "CCL19": "guides immune cells to lymph nodes for adaptive immunity.",
  "CCL11": "is a potent eosinophil chemoattractant in allergic asthma.",
  "CCL23": "has largely unknown function in inflammatory responses.",
  "CCL14": "has unclear function; may regulate macrophage migration.",
  "IL12B": "is the p40 subunit shared by IL-12 and IL-23.",
  "CXCL6": "is a neutrophil chemoattractant regulating cell permeability.",
  "VEGFB": "protects heart cells through metabolic regulation.",
  "IL37-": "is an IL-1 family anti-inflammatory cytokine with broad suppressive effects.",
  "CCL16": "has unknown function; binds multiple receptors.",
  "CCL20": "mediates Th17 responses and gut-associated immune cell homing.",
  "CCL3-": "attracts monocytes and mediates dendritic-T cell interactions.",
  "CCL8-": "mediates Th2 immune responses and tissue-specific homing.",
  "CXCL5": "is an epithelial-derived neutrophil trafficking chemokine.",
  "CCL25": "mediates thymocyte migration and T-cell homing to gut.",
  "CCL13": "promotes Th2 responses and eosinophil recruitment in allergies.",
  "CCL27": "is a skin-homing T-cell chemokine for cutaneous immunity.",
  "CCL28": "mediates T-cell and IgA plasma cell mucosal tissue homing.",
  "CCL18": "promotes Th2 responses and dendritic cell recruitment.",
  "CXCL2": "is a neutrophil recruitment chemokine in inflammatory responses.",
  "CCL26": "recruits eosinophils and basophils in allergic diseases.",
  "CXCL3": "mediates neutrophil chemotaxis for acute inflammatory responses.",
  "VEGFC": "specializes in growing lymphatic vessels key in cancer spread.",
  "IL17F": "is a mucosal IL-17 cytokine regulating epithelial barrier defense.",
  "NODAL": "is an embryonic master switch patterning body layers and asymmetry.",
  "IL23A": "forms IL-23 with IL-12B promoting Th17 expansion and autoimmunity.",
  "VEGFD": "partners with VEGFC in lymphatic development and cancer spread.",
  "IL17B": "is epithelial-derived promoting local inflammatory responses.",
  "IL17C": "drives skin inflammation particularly in psoriasis pathogenesis.",
  "IL17D": "is tissue-protective supporting intestinal barrier function."
}
